<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Estrategias de UnidadII</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
    <link rel="stylesheet" href="css/estilos.css">
    <!--Font awesome-->
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css">

    <!--Bootstap core CSS-->
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstap/4.1.3/css/bootstrap.min/" rel="stylesheet">

    <!--Material Design Bootstrap-->
    <link href="https://cdnjs.cloudflare.com/ajax/libs/mdbootstrap/4.5.11/css/mdb.min.css" rel="stylesheet">
</head>

<body>
    <hr>
    <center>
        <h1>Estrategia de Aprendizaje UnidadII</h1>
    </center>
    <hr>
    <center>
        <h2>
            Estrategia de Aprendizaje#1
        </h2>
    </center>
    <hr>
    <div class="container">
        <p><b>Instrucciones:</b>Investigar en internet u otro medio cada una de las siguientes interrogantes que se muestran a continuaci&oacute;n;el resultado entreg&aacute;rselo impreso al docente.</p>
        <b>1.Existen m&oacute;dulos de memoria DDR5?</b> <br> La memoria RAM DDR5 tendr&aacute; densidades de hasta 1286B por m&oacute;dulo de memoria. <br> <br>
        <b>2.Qu&eacute; son las memorias GDDR5?</b> <br> Es un tipo de memoria utilizado en las tarjetas gr&aacute;ficas espic&iacute;fica para tarjetas gr&aacute;ficas de alto rendimiento. <br> <br>
        <b>3.C&uacute;l es la diferencia entre una memoria para PC de escritorio,una port&aacute;til y un todo en <br>
        uno?  </b> <br> La memoria ram de una computadora p&oacute;rtatil,se diferencia de la de una de escritorio <br> por el tamaño del m&oacute;dulo y de la tarjeta que se inserta en la placa base de una computadora. <br> <br>
        <b>4.C&oacute;mo influye el procesador y la tarjeta madre en la cantidad de memoria que se debe <br>
        utilizar?</b> <br> Porque la memoria ram debe ir acompañada de una motherboard adecuada. <br> <br>
        <b>5.Qu&eacute; tipo de memoria RAM utilizan los tel&eacute;fonos inteligentes?</b> <br> LPDDR4,LPDDR4X,LPDDR5. <br> <br>
        <b>6.Colocar las partes de la memoria RAM en la siguiente imagen:</b> <br>
        </p>

        <img src="img/memoria ram partes.jpg" alt="" width="350px">

        <hr>
        <center>
            <h1> Estrategia de Aprendizaje#2
            </h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Responder las siguientes interrogantes:</p>
        <p><b>1.Q&eacute; es la memoria cach&eacute;</b>? <br> Es un componente de hardware o software que guarda datos para que las solicitudes futuras de esos datos se puedan atender con mayor rapidez.
        </p> <br>
        <p><b>2.D&oacute;nde se almacena el CMOS?</b> <br> En un chip de memoria especial.</p>
    </div>
    <hr>
    <center>
        <h1>Estrategia de Aprendizaje#3</h1>
    </center>
    <hr>
    <div class="container">
        <p><b>Instrucciones:</b>Realizar cada una de las actividades que se le muestran a continuaci&oacute;n.</p>
        <p><b>a.En parejas,determinar 4 nombres que se le dan al Case</b> <br> 1.I-CASE <br> 2.META CASE <br> 3.CAST <br> 4.IPSE
        </p> <br>

        <p><b>b.Individualmente,enlistar 5 partes de un Case.</b> <br> 1.Bah&iacute;as
            <br> 2.Switch <br> 3.Reset <br> 4.Leds indicadores <br> 5.Speaker interno</p>
        <hr>

        <center>
            <h1>Estrategia de Aprendizaje#4</h1>
        </center>
        <hr>
        <table class="table table-dark">
            <center>
                <thead>

                    <td>Pasos para limpiar el teclado</td>
            </center>
            </thead>
            <tbody>
                <tr>
                    <td>1.Desconecta el teclado del ordenador</td>
                </tr>
                <tr>
                    <td>2.Coloca el teclado de manera que las teclas esten</td>
                </tr>
                <tr>
                    <td>3.Con un bote de aire comprimido,soplais bajo las teclas para eliminar el polvo.
                    </td>








                </tr>
            </tbody>
        </table>
        <hr>
        <center>
            <h1>Estrategia de Aprendizaje#5</h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Investigar las interrogantes que se presentan en el cuadro a continuaci&oacute;n</p>
        <table class="table table-dark">
            <thead>
                <th>Interrogantes</th>
                <th>Repuestas</th>
            </thead>
            <tbody>
                <tr>
                    <td>1.Que es un moouse touch?</td>
                    <td>Permite que los usuarios arrastren el dedo en la direcci&oacute;n que deseen que el puntero mouse vaya.
                    </td>
                    <tr>
                        <td>2.Que es un mouse trackball?</td>
                        <td>Es el dispositivo apuntador estacionario,compuesto por una bola incrustada que detecta.</td>
                    </tr>
                    <tr>
                        <td>3.Que mouse se debe utilizar para diseño gr&aacute;fico?
                        </td>
                        <td>Rotaci&oacute;n de la bola es dos ejes Mouse Laser</td>
                    </tr>
                    <tr>
                        <td>4.Que es un Mouse Laser?</td>
                        <td>Esta diseñado para ingenieros y animadores que quieran crear sus modelos de forma m&aacute;s accesible
                        </td>
                    </tr>
                </tr>
            </tbody>
        </table>
        <hr>
        <center>
            <h1>Estrategia de Aprendizaje#6</h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Realizar cada una de las actividades que se muestran a continuaci&oacute;n:</p>
        <p><b>a.Investigar q&uacute;e son las impresoras multifuncionales y c&uacute;al es su funcionamiento.</b> <br> Es un periferico que puede conectarse a la computadora y que posee las siguientes funciones dentro de un mismo <br> y &uacute;nico bloque
            f&iacute;sicos Impresora,Escaner. <br> <br>
            <b>b.Investigar los &iacute;tems,discutir ante sus compañeros y docente las respuestas,posteriormente <br>
            elaborar una s&iacute;ntesis por escrito con los aspectos m&aacute;s relevantes. </b> <br> 1.Usos de una impresora 3D <br> 2.Tipos de impresoras 3D <br> 3.Software utilizado para la impresi&oacute;n en 3D <br> 4.Cantidad de colores
            que utiliza un plotter mocrom&aacute;tico <br> 5.Diferencia entre un plotters de corte y uno de impresi&oacute;n <br> 6.Concepto de resoluci&oacute;n <br> 7.Resoluci&oacute;n que pueden alcanzar las impresoras actuales</p> <br> <br>

        <center>
            <h3>S&iacute;ntesis</h3>
            <p>Una impresora es una dispositivo periferico de salida,del ordenador que permite producir una gama permanente <br> de textos o gr&aacute;ficos de documentos almacenados en un formato electr&oacute;nicos,imprimiendolos en medios f&iacute;sicos,
                <br> normalmente en papel,utilizando cartuchos de tinta o tecnolog&iacute;a l&aacute;ser (cont&oacute;ner).</p>
        </center>
        <hr>
        <center>
            <h1>Estrategia de Aprendizaje#7</h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Investigar en internet sobre:</p>
        <table class="table table-bordered">
            <thead>

                <th>Corotr&oacute;n</th>

            </thead>
            <tbody>
                <td>Concepto:Es un dispositivo capaz de crear una carga el&eacute;ctronica compuesto por un cable corona,si bien algunas veces se presenta en forma de elemento o l&aacute;minas para acentuar la cantidad de puntas existentes para la carga.
                </td>
            </tbody>
        </table>

        <hr>
        <center>
            <h1>Estrategia de Aprendizaje#8</h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Realizar cada una de las actividades que se muestran a continuaci&oacute;n:</p>
        <p><b>a.Enumerar los tipos de discos duros y exponerlos al docente y compañeros</b></p>
        <table class="table table-bordered">
            <thead>

                <th>Tipos de discos curos</th>

            </thead>
            <tbody>
                <td>1.HDD
                </td>
                <tr>
                    <td>2.SSD</td>
                </tr>
            </tbody>
        </table>
        <p><b>b.Investigar en internet cada una de las siguientes interrogantes</b></p>
        <p><b>1.C&oacute;mo se almacena la informaci&oacute;n en un disco duro SSD?</b> <br> Es un tipo de dispositivo de almacenamiento de datos que utiliza memoria no v&oacute;latil <br> como la memoria flash, para almacenar datos. <br> <br>
            <b>2.C&uacute;anta energ&iacute;a necesita un disco duro SSD para funcionar?</b> <br> 1TB consume unos 5,3vatios y los modelos de 2 y 3T consumen 8batios. <br>
            <br> <b>3.C&uacute;al es la diferencia de precios entre discos duros HDD y discos duros SSD?</b> <br> Consumo----SDD menor consumo----HDD Mayor consumo <br> Coste----Caros----Economicos <br> Ruido----Silenciosos----Ruidosos <br></p> <br>
        <p><b>4.Qu&eacute; es un disco duro?</b> <br> Son unidades de almacenamientos que combinan las tecnolog&iacute;as <br> HDD y SDD</p>
        <hr>
        <center>
            <h1>Estrategia de aprendizaje#9</h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Realizar cada una de las actividades que se le muestran a continuaci&oacute;n:</p>
        <p><b>1.Descargar Essenstials Virtual Desktop y realizar pr&aacute;cticas
            virtuales necesarias hasta aprenderse el orden de ensamblado
            de una PC,evidenciar el proceso creando grupos de discusi&oacute;n con la presencia
            del docente y dejando por escrito las ventajas y desventajas de utilizar este proceso.
        </b> <br> <br>
            <b>2.De los dispositivos que se instalaron virtualmente en Essenstials Virtual Desktop,c&uacute;ales ya <br>
    no se utilizan.</b> <br> <br>
            <b>3.Descargue de internet y aprenda a utilizar IT Essenstials Virtual Laptop,finalmente, <br>
explique en un documento de WOrd,c&uacute;al es el proceso de utilizaci&oacute;n</b></p>
        <hr>
        <center>
            <h1>Estrategia de Aprendizaje#3</h1>
        </center>
        <hr>
        <p><b>Instrucciones:</b>Realizar cada una de las instrucciones que se muestran a continuaci&oacute;n y dejar <br> evidencias de las mismas.</p>
        <p><b>1.Cree</b> nomenclaturas para asignar al equipo de c&oacute;mputo del laboratorio del centro <br> educativo a cada alumno <br> <br>
            <b>2.Especifique</b> los procedimientos que se realizaron para asignar el equipo <br> <br>
            <b>3.Publique</b> los listados de asignaci&oacute;n de equipo para que cada alumno conozca d&oacute;nde le <br> corresponde sentarse. <br> <br>
            <b>4.Determine</b> con sus compañeros las necesidades de el por qu&eacute; ser&iacute;a ncesario que se le <br> asigne una silla a cada alumno y c&oacute;mo identificarla
        </p>
        <button type="button" class="btn btn-outline-primary"><a href="Perifericos.html">Regresar a la p&aacute;gina anterior</button></a>

    </div>

</body>

</html>