<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">

    <title>Funciones</title>
</head>

<body>
    <div class="container-md">

        <center>
            <h1>Funciones</h1>
        </center>
        <p>Una funci&oacute;n es un conjunto de instrucciones que realizan una tarea determinada,las instrucciones est&aacute;n <br> agrupadas en un mismo bloque que puede ser llamado desde cualquier parte del c&oacute;digo;de esta manera, <br> las funciones
            nos ayudan a que no tengamos que repetir cierto c&oacute;digo cada vez que deseamos realizar la <br> misma tarea.
        </p>
        <p>Existen dos tipos de funciones: <br>
            <b>*Funciones Predefinidas:</b>Son funciones que ya vienen integradas en el lenguaje de programaci&oacute;n,en <br> este caso en <b>PHP.</b>Como ya existen solamente necesitamos llamarlas como <b>Count.</b> <br>
            <b>*Funciones Creadas por el Usuario:</b>Son funciones que no existen pero que el usuario <b>(programador) </b> <br> puede crear con el objetivo de realizar c&aacute;lculos complejos,actividades que no est&aacute;n definidas en el <br> lenguaje,etc.
        </p>
        <h2>Crear Funciones</h2>
        <img src="img/funciones.png" alt="">e
        <p>Donde: <br>
            <b>*function:</b>Es la instrucci&oacute;n que nos permitir&aacute; crear una funci&oacute;n. <br>
            <b>*nombreFuncion:</b>Representa el nombre que se le asignar&aacute; a la funci&oacute;n. <br>
            <b>$argumentos:</b>Son los datos necesarios para poder ejecutar la funci&oacute;n,por ejemplo una funci&oacute;n que <br> realice la suma de dos n&uacute;meros,necesitar&aacute; que le pasemos argumentos par&aacute;metros esos dos n&uacute;meros.
            <br> <br> El argumento puede ser cualquier variable y se utilizar&aacute; dentro de la funci&oacute;n para operar con ella y <br> obtener el resultado.No todas las funciones necesitar&aacute;n datos como argumentos.</p>
        <p> <b>{Instrucciones}:</b>Grupo de c&oacute;idgo que permitir&aacute; realizar todas las actividades,necesarias para poder <br> obtener un resultado. <br>
            <b>*return:</b>Se utiliza para indicar el valor que devolver&aacute; la funci&oacute;n.</p>

        <p><b>Ejemplos:</b> <br> 1.Crear una funci&oacute;n que permita realizar la suma de dos n&uacute;meros </p>
        <img src="img/codigo funcion.png" alt="950px" width="250px">
        <p><b>C&oacute;digo del formulario y la utilizaci&oacute;n de la funci&oacute;n suma:</b>El archivo se llamar&aacute; funcion1_formulario. <br> php
        </p>
        <img src="img/funcion formulario.png" width="950px" width="250px">
        <p>En el ejemplo,se utiliza el c&oacute;digo <b><?php include("funcion1.php");?></b>para incluir el archivo funcion1. <br> php. <br> La funci&oacute;n se llama en la l&iacute;nea de c&oacute;digo <b>$n3=suma($n1,$n2);?></b> d&oacute;nde se le pasa
            por par&aacute;metros los <br>valores de <b>$n1 y $n2</b> devolviendo como resultado de la suma de esos valores y asign&aacute;ndola a <b>$n3.</b> <br> <br> En la instrucci&oacute;n <b>< link href="estilofares.css" rel="stylesheet" type="text/css"></b>            se hace referencia al <br> archivo de estilos (estilosfares.css) que se cre&oacute; al en la unidad anterior,copiarlo a la carpeta d&oacute;nde se <br> est&aacute; trabajando con estos archivos. <br> <br> 2.Crear una aplicaci&oacute;n que
            permita introducir un n&uacute;mero entero y el tipo de ra&iacute;z que deseamos para ese <br> n&uacute;mero,devolver como resultado la ra&iacute;z en&eacute;sima del mismo.Crear una funci&oacute;n para la ra&iacute;z.</p>

        <p><b>C&oacute;digo de la funci&oacute;n:</b>El archivo se debe llamar funci&oacute;n2</p>
        <img src="img/funcion2.png" alt="950px" width="250px">
        <p><b>C&oacute;digo del formulario y utilizaci&oacute;n de la funci&oacute;n ra&iacute;zfares:</b>El archivo se llamar&aacute; funcion2_formulario. <br> php
        </p>



        <a href="Programacion Orientada a Objetos.html">Ir a la siguiente p&aacute;gina</a>

    </div>
</body>

</html>