<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
    <title>Introduccion</title>
</head>
<body>
    <h2>INTRODUCCI&Oacute;N</h2>
    <p>Los conocimientos son esenciales para el desempe単o profesional,sin los cuales es imposible <br>
    lograr las habilidades para competir laboralmente.Con el creciente uso del internet nos vemos <br>
en la necesidad de crear sitios web interactivos;por lo que Ediciones Fares pone a su disposici&oacute;n <br>
el libro de Dise単o Web I y II.</p>


<p>El avance de la tecnolog&iacute;a hace necesario actualizar continuamente esos conocimientos,por esa <br>
raz&oacute;n,cuando tomamos la decisi&oacute;n de embacarnos en una actividad profesional adquirimos <br>
el compromiso de mantenernos el d&iacute;a en los conocimientos del &aacute;rea d&oacute;nde hemos decidido <br>
desempe単arnos.Ediciones Fares ofrece conocimiento actualizado a estudiantes y profesiones <br>
dentro de los lineamientos pedag&oacute;gicos que ayuden a adquirir las competencias requeridas en <br>
el &aacute;rea de inform&aacute;tica. <br> <br>

Este texto tiene la finalidad de despertar el inter&eacute;s del estudiante y facilitar la comprensi&oacute;n y <br>
apropiaci&oacute;n del conocimiento en la creaci&oacute;n de sitios web interactivos utilizando HTML 5,CSS3 <br>
y PHP. <br> <br>

En cada unidad se desarrollan diversas actividades pedag&oacute;gicas que permiten asegurar la <br> asimilaci&oacute;n 
de la programaci&oacute;n PHP en integraci&oacute;n con HTML5.Tambi&eacute;n se incluye el uso de <br>
las bases de datos utilizando el gestor MySQL,Sistema de Gesti&oacute;n de Base de Datos Relacional, <br>
Multihilo y Multiusuario muy utilizado en p&aacute;ginas web.El dise単o de los sitios se realiza en <br>
Dreamweaver CC y como servidor se utiliza Apache. <br> <br>


Una vez que haya finalizado el estudio de este texto tendr&aacute; los conocimientos necesarios para <br>
desarrollar p&aacute;ginas web e integrarlas a la internet con facilidad. <br>


Cabe resaltar,que el libro est&aacute; contemplado para dos semestres e incluye estrategias de<br>
aprendizaje que facilitan el aprendizaje que facilitan el aprendizaje y la obteci&oacute;n de los resultados <br>
esperados por el docente.A su vez,loslibros incluyen autoevaluaciones con el objeto de valorar <br>
conocimientos propios de parte de los discentes;glosario con terminolog&iacute;a de la informaci&oacute;n <br>que contiene el escrito,finalmente,una bibliograf&iacute; que refiere a otras publicaciones y as&iacute; <br>
aumentar los conocimientos.
</p>
</body>
</html>