<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
    <link rel="stylesheet" href="css/carousel.css">
    <title>Programaci&oacute;n Orientada a Objetos</title>

    </div>
</head>

<body>
    <div id="carouselExampleControls" class="carousel slide" data-bs-ride="carousel">
        <div class="carousel-inner">
            <div class="carousel-item active">
                <img src="img/programacion.png" class="d-block w-100" alt="...">
            </div>
            <div class="carousel-item">
                <img src="img/orientada.jpg" class="d-block w-100" alt="...">
            </div>
            <div class="carousel-item">
                <img src="img/objetos.jpg" class="d-block w-100" alt="...">
            </div>
        </div>
        <button class="carousel-control-prev" type="button" data-bs-target="#carouselExampleControls" data-bs-slide="prev">
        <span class="carousel-control-prev-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Previous</span>
        </button>
        <button class="carousel-control-next" type="button" data-bs-target="#carouselExampleControls" data-bs-slide="next">
        <span class="carousel-control-next-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Next</span>
        </button>
    </div>



    <script src="https://cdn.jsdelivr.net/npm/@popperjs/core@2.10.2/dist/umd/popper.min.js" integrity="sha384-7+zCNj/IqJ95wo16oMtfsKbZ9ccEh31eOz1HGyDuCQ6wgnyJNSYdrPa03rtR1zdB" crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/js/bootstrap.min.js" integrity="sha384-QJHtvGhmr9XOIpI6YVutG+2QOK9T+ZnN4kzFN1RtK3zEFEIsxhlmWl5/YESvpZ13" crossorigin="anonymous"></script>
    <div class="contenedor">

    </div>


    <ul class="nav nav-tabs">
        <li class="nav-item">
            <a class="nav-link active" aria-current="page" href="https://edicionesfares.com">Ediciones Fares</a>
        </li>

        <li class="nav-item">
            <a class="nav-link active" aria-current="page" href="introduccion diseño.html">Inicio</a>
        </li>

        <li class="nav-item dropdown">
            <a class="nav-link dropdown-toggle" data-bs-toggle="dropdown" href="#" role="button" aria-expanded="false">Estrategias de Aprendizaje</a>
            <ul class="dropdown-menu">
                <li><a class="dropdown-item" href="Estrategias de Diseño.html">Estrategias de Aprendizaje UnidadI</a></li>
                <hr class="dropdown-divider">
                <li><a class="dropdown-item" href="#">Estrategias de Aprendizaje UnidadII</a></li>
                <hr class="dropdown-divider">
                <li><a class="dropdown-item" href="Estrategias de Aprendizaje1.html">Estrategias de Aprendizaje UnidadIII</a></li>
                <hr class="dropdown-divider">
                <li><a class="dropdown-item" href="#">Estrategias de Aprendizaje UnidadIII</a></li>
                <hr class="dropdown-divider">

                <li><a class="dropdown-item" href="#">Estrategias de Aprendizaje UnidadIV</a></li>

                <li>

                </li>
            </ul>
        </li>
    </ul>





    <section>

        <div class="float-sm-start">
            <div class="clearfix">
                <img src="img/orienta a objetos.png" class="col-md-6 float-md-end mb-3 ms-md-3" alt="" width="550px">

                <h2>Programaci&oacute;n Orientada a Objetos</h2>

                <hr>
                <p>Es un paradigma de programaci&oacute; que facilita la creaci&oacute;n de Software con calidad porque poten-<br>cia el mantenimiento,la extensi&oacute;n y la reutilizaci&oacute;n del software generado bajo este paradigma.
                    <br>
                    <br> La programaci&oacute;n orientada a objetos busca amoldarse al modo de pensar del hombre <br> y no al de la m&aacute;quina.Esto es posible gracias a la forma con la que se manejan las <br> abstracciones que representan las entidades
                    del dominio del problema,y a propiedades <br> como la jerarqu&iacute;a o el encapsulamiento. <br> <br> La programaci&oacute;n orientada a objetos permite concebir los programas de una manera bastante
                    <br> intuitiva y cercana a la realidad.</p>
                <hr>
                <h2>Clases</h2>
                <p>Es una plantilla o molde que permite la creaci&oacute;n de un objeto.</p>

                <p>Las clases presentan el estado de los objetos a los que representan mediante variables denominadas
                    <b>atributos</b>.Cuando se instancia un objeto,el compilador crea en la memoria din&aacute;mica un espacio para tantas variables como atributos tenga la clase a la que pertenece el objeto.</p>

                <p>Podemos utilizar como ejemplo el molde para la fabricaci&oacute;n de <b>Adobes(utilizados en la creaci&oacute;n de
                cosas)</b>para comprender el concepto de clase.</p>

                <p>Para hacer un adobe,primeramente,se extrae los elementos necesarios para hacerlos(tierra y zacate otro material para que amarre),una vez con los materiales se realizan las siguientes actividades:</p>
                <p>*Se hace la mezcla de la tierra,agua y el componente para que amarre. <br> *Una vez lista la mezcla,esta se vierte sobre el molde que le dar&aacute; forma y tamaño del adobe. <br> *Se retira el molde y queda fabricado el adobe.</p>
                <p>*Se deja al sol para que endurezca y poder ser utilizado.</p>

                <p>Si se observa detenidamente,el adobe adquiri&oacute; muchas de las propiedades del molde (tiene la misma <br> forma y dimensi&oacute;n);sin embargo,el molde no puede ser utilizado para crear la casa,no es un adobe,s&oacute;lo <br> se utiliza
                    para hacerlos.
                </p>
                <img src="img/clase.png" class="img-fluid" alt="...">
                <p class="text-end">En la <b>OOP</b> o <b>POO</b>(Objetc Oriented Programming o Programaci&oacute;n Orientada a Objetos) el molde del adobe <br> hace las veces de una clase.La clase es una plantilla que por s&iacute; misma no es un objeto,sin embargo,le <br>                    confiere muchas de sus caracter&iacute;sticas a estos cuando son creados.El objeto puede tener sus propias <br> caracter&iacute;sticas,no necesariamente iguales a estos cuando son creados a las de su clase(el molde es de <br> metal
                    o de madera y el adobe de tierra y zacate) pero el contexto global,son bastante parecidos.</p>









            </div>

        </div><br>
        <div class="float-md-start">


        </div>
        <div class="float-xl-start">
            <h2>Caracter&iacute;sticas de los Objetos</h2>
            <p>Por ser entes que pueden ser manipulados en el mundo real,los objetos tienen caracter&iacute;sticas que <br> los distinguen.En este libro,se expoen tres grandes elementos: <br> <br>
                <p>Para ir creando y probando los ejemplos relacionados con objetos,regresemos al sitios IIIunidad. <br> <br> Para crear una clase se utiliza la siguiente sintaxis:</p>
                <img src="img/clase php.png" alt="950px" width="250px">
                <p><b>Ejemplo:</b>Crear un archivo con el nombre de clase1.php</p>
                <img src="img/clase1 php.png" alt="950px" width="250px">
                <div class="card-group">
                    <div class="card">
                        <div class="card-body">
                            <img src="img/atributo.png" alt="650px" width="400px">
                            <h5 class="card-title">1.Atributos</h5>
                            <p class="card-text">Son caracter&iacute;sticas que definen al objeto;tambi&eacute;n son conocidas como propiedades y <br> proporcionan informaci&oacute;n acerca del ente.Por ejemplo,una pizarra tiene varios atributos: su tamaño,<br>color,forma,sus
                                diemensiones,etc.No deben confundirse los atributos con sus valores.Muchas personas <br> piensan que un atributo de una computadora es que es negra.La propiedad es el color y el valor de <br> esta propiedad es negro</p>
                            <a href="propiedad.html" class="btn btn-primary">Propiedades o Atributos</a>
                        </div>
                    </div>
                    <div class="card">
                        <div class="card-body">
                            <img src="img/metodo.png" alt="650px" width="400px">
                            <h5 class="card-title">2.M&eacute;todos</h5>
                            <img src="" alt="">
                            <p class="card-text">Son operaciones que un objeto puede llevar acabo para transformar el entorno en que <br> se encuentran o para comunicarse con otros objetos.Un autom&oacute;vil posee un m&eacute;todo de arranque, <br> que le permite ponerse
                                en marcha as&iacute; como posee un m&eacute;todo de frenado que le permite detenerse. <br> Un t&eacute;lefono celular que posee un m&eacute;todo de emisi&oacute;n de señal,que le permite comunicarse con otros <br> al mismo
                                tiempo.
                            </p>

                        </div>
                    </div>
                    <div class="card">
                        <img src="img/evento.png" class="card-img-top" alt="650px" width="400px">
                        <div class="card-body">
                            <h5 class="card-title">3.Eventos</h5>
                            <p class="card-text">Es una acci&oacute;n llevada acabo por un ente externo que modifica el estado del objeto.Una <br> persona(objeto) enciende (evento) un autom&oacute;vil (objeto) con lo que el carro pasa de un estado de <br> inmovilidad a uno
                                de movimiento.Una persona hace click con el bot&oacute;n izquierdo del mouse de <br> computadora,para que esta lleve a cabo una acci&oacute;n. <br> <br> Las clases funcionan como moldes que permiten crear objetos;de un
                                modo m&aacute;s preciso,
                                <b>instancias</b> <br>
                                <b>(individuos)</b>.Es decir,a partir del molde "persona",creamos una instancia "alumno" y otra "empleado" <br> todas instancias de la clase "persona".</p>

                        </div>
                    </div>
                </div>






                <h2>Propiedades o Atributos</h2>
                <p>La variables pertenecientes a una clase se llaman "propiedades".Tambi&eacute;n se les puede llamar usando <br> otros t&eacute;rminos como "atributos" o "campos".</p>
                <p><b>Ejemplo:</b></p>
                <img src="img/ejemplo dos poo.png" alt="">
                <h2>Crear un Objeto e Instanciar una Clase</h2>
                <p>Para crear un objeto a partir de una clase existente se utiliza la siguiente sintaxis:</p>
                <img src="img/objeto clase.png" alt="">
                <p>Como se observa en la sintaxis,para instanciar una clase se utiliz&oacute; la palabra reservada new. <br> <br>
                    <b>Ejemplo:</b>Crear un archivo con el nombre pruebaclase1.php. <br> <br> Primero importaremos el archivo clase1.php d&oacute;nde se encuentra la clase persona como require_once.</p>
                <img src="img/case.png" alt=""> <br>
                <p><b>Resultado:</b></p>
                <img src="img/case resultado.png" alt="">
                <h2>M&eacute;todos</h2>
                <p>Los m&eacute;todos de una clase corresponden con las acciones que es capaz de hacer la clase (son "verbos" en <br> infinitivo);en otras palabras,los m&eacute;todos son acciones que modifican alguna propiedad del objeto.</p>
                <p><b>Ejemplo:</b></p>
                <img src="img/metodos.png">
                <p>Como se puede observar en el ejemplo,se cre&oacute; un m&eacute;todo llamado saludar y se utiliza $this para llamar <br> a las propiedades de la clase.</p>
                <p>Para comprobar el comportamiento del m&eacute;todo,observemos:</p>
                <img src="img/php modificado.png" alt="">
                <p>Con la instrucci&oacute;n echo <b>$alumno->saludar();</b>se llam&oacute; al m&eacute;todo saludar(). </p>
        </div>





        </div>
        <div class="container-sm">
            <h2>Constructores</h2>
            <p>Los constructores son funciones en una clase que son invocadas autom&aacute;ticamente cuando se crea una nueva instancia de una clase con new.Si una clase no tiene constructor,el constructor de la clase base <br> ser&aacute; invocado,si es
                que existe. <br> <br> El objetivo fundamental del constructor es inicializar los atributos del objeto que creamos. <br> <br> Las ventajas de implementar un constructor en lugar del m&eacute;todo inicializar son: <br> <br>
            </p>
            <p>*El constructor es el primer m&eacute;todo que se ejecuta cuando se crea un objeto. <br> *El constructor se llama autom&aacute;ticamente,es decir,es imposible de olvidarse llamarlo ya que se <br> llamar&aacute; autom&aacute;ticamente.
                <br> *Quien utiliza <b>POO(Programaci&oacute;n Orientada a Objetos)</b> conoce el objetivo de este m&eacute;todo. <br> <br> Otras caracter&iacute;sticas de los constructores son:</p>
            <p>*El constructor se ejecuta inmediatamente luego de crear un objeto y no puede ser llamado nuevamente. <br> <br> *Un constructor no puede retornar dato. <br> <br> *Un constructor puede recibir par&aacute;metros que se utilizan normalmente para
                inicializar atributos. <br> <br>*El constructor es un m&eacute;todo opcional.</p>

            <p>El constructor se crea con la palabra <b>function</b> seguido de un espacio,dos guiones bajos(__) y la palabra construct y entre par&eacute;ntesis los argumentos (argumento1,argumento2,etc.)</p>
            <p>Como se puede observar las variables se inicializan en el constructor con los valores que son <br> pasados a trav&eacute;sde par&aacute;metros del constructor.</p>
            <p>El c&oacute;digo <b>echo 'Hola,soy'.$this->nombre.'tengo'.$this->edad.'años y sexo.$this->sexo.";</b> <br> imprime los valores de las variables,pero en este ejemplo,esta l&iacute;nea de c&oacute;digo solamente se utiliza para ejemplificar
                que al crear una nueva instancia de la clase,se llama autom&aacute;ticamente al constructor.</p>
            <p>El constructor se llama en la misma l&iacute;nea d&oacute;</p>
        </div>
        <div class="container-md">100% wide until medium breakpoint</div>
        <div class="container-lg">

        </div>
        <div class="container-xl">

        </div>
        <div class="container-xxl">100% wide until extra extra large breakpoint</div>



    </section>
</body>

</html>